//RAKFUSER EXEC PGM=RAKFUSER                                            00010000
//RAKFUSER DD DSN=SYS1.SECURE.CNTL(USERS),DISP=SHR                      00020000
